import React from 'react';
import {StyleSheet, Text, View} from "react-native";
import BottomNavigator from "../NavigatorMenu/BottomNavigator";

const Map = ({stateChanger}) => {

    const styles = StyleSheet.create({
        Wrapper:{
            width:'100%',
            height:'100%',
            backgroundColor:'green',
        },
    })




    return (
        <View style={styles.Wrapper}>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>
                <Text>Фрагмент карты!  Фрагмент карты! </Text>


        </View>
    );
};

export default Map;
